% 题目：
% 生物学家试图对两种蠓虫（Af与Apf）进行鉴别 ,依据的资料是触角和翅膀的长度 ,已经测得了9只Af和6只Apf的数据如下：
% Af:(1.24, 1.27)  , (1.36, 1.74)  , (1.38, 1.64)  , (1.38, 1.82)  ,(1.38, 1.90) ,(1.40, 1.70) ,(1.48, 1.82) ,(1.54, 1.82) ,(1.56, 2.08)；
% Apf:(1.14, 1.82)  , (1.18, 1.96)  , (1.20, 1.86)  , (1.26, 2.00)  ,(1.28, 2.00) ,(1.30, 1.96).
% （i）根据如上资料 ,如何制定一种方法 ,正确地区分两类蠓虫；
% （ii）对触角和翼长分别为(1.24, 1.80) ,(1.28, 1.84)与(1.40, 2.04)的三个标本 ,用所得到的方法加以识别.

clear;

%样本 网络输入
p1 = [1.24, 1.27; 1.36, 1.74; 1.38, 1.64; 1.38, 1.82; 1.38, 1.90; 1.40, 1.70; 1.48, 1.82; 1.54, 1.82; 1.56, 2.08];
p2 = [1.14, 1.82; 1.18, 1.96; 1.20, 1.86; 1.26, 2.00; 1.28, 2.00; 1.30, 1.96];
p = [p1; p2]';

pr = minmax(p);
goal = [ones(1, 9), zeros(1, 6); zeros(1, 9), ones(1, 6)]; % 样本标签/理想输出
% plot(p1(:, 1), p1(:, 2), 'h', p2(:, 1), p2(:, 2), 'o');

% 建立新网络
net = newff(pr, [10, 2], {'logsig', 'logsig'});
net.trainParam.show = 10;
net.trainParam.lr = 0.005;
net.trainParam.goal = 1e-10;
net.trainParam.epochs = 500000;

% 训练网络
net = train(net, p, goal);

% 用输入p检验网络
y0 = sim(net, p);

% 用x检验网络
x = [1.24 1.80; 1.28 1.84; 1.4 2.04]';
y = sim(net, x)
